#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.github_user.benoit: Reading...
data.github_user.meejah: Reading...
data.github_user.andreas: Reading...
module.team_internal.github_team.team[0]: Refreshing state... [id=6696813]
module.team_test.github_team.team[0]: Refreshing state... [id=6696811]
data.github_user.florian: Reading...
data.github_user.chris: Reading...
module.repo1.github_repository.repository: Refreshing state... [id=test-repo-1]
data.github_user.caitlin: Reading...
data.github_user.jean_paul: Reading...
data.github_user.bashir: Reading...
module.repo2.github_repository.repository: Refreshing state... [id=test-repo-2]
module.repository_project.github_repository.repository: Refreshing state... [id=project]
data.github_user.benoit: Read complete after 2s [id=7703888]
module.team_project.github_team.team[0]: Refreshing state... [id=6696757]
module.team_foo.github_team.team[0]: Refreshing state... [id=6696818]
module.repo2.github_team_repository.team_repository_by_slug["test"]: Refreshing state... [id=6696811:test-repo-2]
data.github_user.andreas: Read complete after 3s [id=563314]
module.repository_project.github_team_repository.team_repository_by_slug["project"]: Refreshing state... [id=6696757:project]
data.github_user.meejah: Read complete after 3s [id=145599]
data.github_user.jean_paul: Read complete after 4s [id=254565]
module.team_project.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696757:wuan]
module.team_project.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696757:exarkun]
module.team_internal.github_team_membership.team_membership["meejah"]: Refreshing state... [id=6696813:meejah]
module.team_internal.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696813:wuan]
data.github_user.florian: Read complete after 4s [id=454605]
module.team_internal.github_team_membership.team_membership["btlogy"]: Refreshing state... [id=6696813:btlogy]
data.github_user.chris: Read complete after 4s [id=882430]
module.team_internal.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696813:exarkun]
data.github_user.caitlin: Read complete after 4s [id=63412287]
module.repo1.github_repository_collaborator.collaborator["hacklschorsch"]: Refreshing state... [id=test-repo-1:hacklschorsch]
module.team_foo.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696818:exarkun]
data.github_user.bashir: Read complete after 4s [id=66448757]
module.team_foo.github_team_membership.team_membership["crwood"]: Refreshing state... [id=6696818:crwood]
module.team_test.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696811:exarkun]
module.team_test.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696811:wuan]
module.team_test.github_team_membership.team_membership["meejah"]: Refreshing state... [id=6696811:meejah]
module.team_test.github_team_membership.team_membership["c-chroniko"]: Refreshing state... [id=6696811:c-chroniko]
module.repo1.github_team_repository.team_repository_by_slug["foo"]: Refreshing state... [id=6696818:test-repo-1]
module.repo1.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=test-repo-1:main]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.team_audit_foo.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Foo Audit"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "foo-audit"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.team_audit_foo.github_team_membership.team_membership["bashirabuamr"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "bashirabuamr"
    }

  # module.team_audit_foo.github_team_membership.team_membership["c-chroniko"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "c-chroniko"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @wuan, Action: `pull_request`, Working Directory: ``, Workflow: `GitHub config CI`*